<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'الفواتير',
            'فواتيري',
            'قائمه الفواتير',
            'الفواتير المدفوعه',
            'الفواتير المدفوعه جزئيا',
            'الفواتير الغير مدفوعه',
            'الفواتير المؤجله',
            'الفواتير المؤرشفه',
            'التقارير',
            'تقاريري',
            'تقرير الفواتير',
            'تقرير العملاء',
            'المستخدمين',
            'قائمه المستخدمين',
            'صلاحيات المستخدمين',
            'الاعدادات',
            'المنتجات',
            'الاقسام',

            'اضافه فاتوره',
            'حذف الفاتوره',
            'تصدير EXCEL',
            'تغيير حاله الدفع',
            'تعديل الفاتوره',
            'ارشفه الفاتوره',
            'استرجاع الفاتوره',
            'طباعه الفاتوره',
            'اضافه مرفق',
            'حذف المرفق',

            'اضافه مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            'عرض صلاحيه',
            'اضافه صلاحيه',
            'تعديل صلاحيه',
            'حذف صلاحيه',

            'اضافه منتج',
            'تعديل منتج',
            'حذف منتج',

            'اضافه قسم',
            'تعديل قسم',
            'حذف قسم',
            'الاشعارات'
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
